Revit 2026 API
FlexDuct.Create Method
Overload List
Name | Description
Create(Document, ElementId, ElementId, ElementId, IList<XYZ>)
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IList<XYZ>)
Top
See Also
Reference
FlexDuct Class
Autodesk.Revit.DB.Mechanical Namespace